---
type: PrintSetting
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# PrintSetting

`Autodesk.Revit.DB.PrintSetting` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Name | — | `public override string Name { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | PrintParameters | — | `public virtual PrintParameters PrintParameters { get ; }` |